[
  {
    "path": "posts/2021-03-25-point-count-data-analysis/",
    "title": "Point-count Data Analysis",
    "description": "Analysis of point-count data in the presence of variable survey methodologies and detection error offered by Peter Solymos to BIOS2 Fellows in March 2021.",
    "author": [
      {
        "name": "Peter Solymos",
        "url": {}
      }
    ],
    "date": "2021-03-25",
    "categories": [
      "Training",
      "Twelve hour"
    ],
    "contents": "\n\nContents\nInstructor\nOutline\nGet course materials\nInstall required software\nGet the notes\n\nUseful resources\nReferences\nLicense\n\n\nThis course is aimed towards researchers analyzing field observations, who are often faced by data heterogeneities due to field sampling protocols changing from one project to another, or through time over the lifespan of projects, or trying to combine ‘legacy’ data sets with new data collected by recording units.\nSuch heterogeneities can bias analyses when data sets are integrated inadequately, or can lead to information loss when filtered and standardized to common standards. Accounting for these issues is important for better inference regarding status and trend of species and communities.\nAnalysts of such ‘messy’ data sets need to feel comfortable with manipulating the data, need a full understanding the mechanics of the models being used (i.e. critically interpreting the results and acknowledging assumptions and limitations), and should be able to make informed choices when faced with methodological challenges.\nThe course emphasizes critical thinking and active learning through hands on programming exercises. We will use publicly available data sets to demonstrate the data manipulation and analysis. We will use freely available and open-source R packages.\nThe expected outcome of the course is a solid foundation for further professional development via increased confidence in applying these methods for field observations.\nInstructor\nDr. Peter SolymosBoreal Avian Modelling Project and the Alberta Biodiversity Monitoring InstituteDepartment of Biological Sciences, University of Alberta\nOutline\nEach day will consist of 3 sessions, roughly one hour each, with short breaks in between.\n\nThe video recordings from the workshop can be found on YouTube.\n\nSession\nTopic\nFiles\nVideos\nDay 1\nNaive techniques\n\n\n\n1. Introductions\nSlides\nVideo\n\n2. Organizing point count data\nNotes\nPart 1, Part 2\n\n3. Regression techniques\nNotes\nPart 1, Part 2\nDay 2\nBehavioral complexities\n\n\n\n1. Statistical assumptions and nuisance variables\nSlides\nVideo\n\n2. Behavioral complexities\nNotes\nbSims, Video\n\n3. Removal modeling techniques\nNotes\nVideo\n\n4. Finite mixture models and testing assumptions\nNotes\nMixtures, Testing\nDay 3\nThe detection process\n\n\n\n1. The detection process\nSlides\nVideo\n\n2. Distance sampling and density\nNotes\nVideo\n\n3. Estimating population density\nNotes\nVideo\n\n4. Assumptions\nNotes\nVideo\nDay 4\nComing full circle\n\n\n\n1. QPAD overview\nSlides\nVideo\n\n2. Models with detectability offsets\nNotes\nOffsets, Models\n\n3. Model validation and error propagation\nNotes\nValidation, Error\n\n4. Recordings, roadsides, closing remarks\nNotes\nVideo\nGet course materials\nInstall required software\nFollow the instructions at the R website to download and install the most up-to-date base R version suitable for your operating system (the latest R version at the time of writing these instructions is 4.0.4).\nThen run the following script in R:\nsource(\"https://raw.githubusercontent.com/psolymos/qpad-workshop/main/src/install.R\")\nHaving RStudio is not absolutely necessary, but it will make life easier. RStudio is also available for different operating systems. Pick the open source desktop edition from here (the latest RStudio Desktop version at the time of writing these instructions is 1.4.1106).\nPrior exposure to R programming is not necessary, but knowledge of basic R object types and their manipulation (arrays, data frames, indexing) is useful for following hands-on exercises. Software Carpentry’s Data types and structures in R is a good resource to brush up your R skills.\nGet the notes\nIf you don’t want to use git:\nDownload the workshop archive release into a folder\nExtract the zip archive\nOpen the workshop.Rproj file in RStudio (or open any other R GUI/console and setwd() to the directory where you downloaded the file)\n(You can delete the archive)\nIf you want to use git: fork or clone the repository\ncd into/your/dir\ngit clone https://github.com/psolymos/qpad-workshop.git\nUseful resources\nUsing the QPAD package to get offsets based on estimates from the Boreal Avian Modelling Project’s database\nNA-POPS: Point count Offsets for Population Sizes of North America landbirds\nReferences\nSólymos, P., Toms, J. D., Matsuoka, S. M., Cumming, S. G., Barker, N. K. S., Thogmartin, W. E., Stralberg, D., Crosby, A. D., Dénes, F. V., Haché, S., Mahon, C. L., Schmiegelow, F. K. A., and Bayne, E. M., 2020. Lessons learned from comparing spatially explicit models and the Partners in Flight approach to estimate population sizes of boreal birds in Alberta, Canada. Condor, 122: 1-22. PDF\nSólymos, P., Matsuoka, S. M., Cumming, S. G., Stralberg, D., Fontaine, P., Schmiegelow, F. K. A., Song, S. J., and Bayne, E. M., 2018. Evaluating time-removal models for estimating availability of boreal birds during point-count surveys: sample size requirements and model complexity. Condor, 120: 765-786. PDF\nSólymos, P., Matsuoka, S. M., Stralberg, D., Barker, N. K. S., and Bayne, E. M., 2018. Phylogeny and species traits predict bird detectability. Ecography, 41: 1595-1603. PDF\nVan Wilgenburg, S. L., Sólymos, P., Kardynal, K. J. and Frey, M. D., 2017. Paired sampling standardizes point count data from humans and acoustic recorders. Avian Conservation and Ecology, 12(1):13. PDF\nYip, D. A., Leston, L., Bayne, E. M., Sólymos, P. and Grover, A., 2017. Experimentally derived detection distances from audio recordings and human observers enable integrated analysis of point count data. Avian Conservation and Ecology, 12(1):11. PDF\nSólymos, P., and Lele, S. R., 2016. Revisiting resource selection probability functions and single-visit methods: clarification and extensions. Methods in Ecology and Evolution, 7:196-205. PDF\nMatsuoka, S. M., Mahon, C. L., Handel, C. M., Sólymos, P., Bayne, E. M., Fontaine, P. C., and Ralph, C. J., 2014. Reviving common standards in point-count surveys for broad inference across studies. Condor 116:599-608. PDF\nSólymos, P., Matsuoka, S. M., Bayne, E. M., Lele, S. R., Fontaine, P., Cumming, S. G., Stralberg, D., Schmiegelow, F. K. A. & Song, S. J., 2013. Calibrating indices of avian density from non-standardized survey data: making the most of a messy situation. Methods in Ecology and Evolution 4:1047-1058. PDF\nMatsuoka, S. M., Bayne, E. M., Sólymos, P., Fontaine, P., Cumming, S. G., Schmiegelow, F. K. A., & Song, S. A., 2012. Using binomial distance-sampling models to estimate the effective detection radius of point-counts surveys across boreal Canada. Auk 129:268-282. PDF\nLicense\nThe course material is licensed under Attribution-NonCommercial-ShareAlike 4.0 International (CC BY-NC-SA 4.0) license. Source code is under MIT license.\n\n\n\n",
    "preview": "posts/2021-03-25-point-count-data-analysis/thumb.jpg",
    "last_modified": "2021-04-19T15:31:33-04:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-01-22-introduction-aux-concepts-edi-en-contexte-scientifique/",
    "title": "Introduction aux concepts EDI en contexte scientifique",
    "description": "Une courte introduction aux concepts de l'EDI dans un contexte scientifique.",
    "author": [
      {
        "name": "Agathe Riallan",
        "url": {}
      },
      {
        "name": "Marie-José Naud",
        "url": {}
      }
    ],
    "date": "2021-01-22",
    "categories": [
      "Career",
      "FR"
    ],
    "contents": "\nEn 2021, nous aurons une série de formations et d’activités de réflexion sur les questions d’équité, diversité et d’inclusion. Notre objectif est de mettre en place un plan d’action EDI pour le programme afin de consolider un environnement plus inclusif, respectueux et ouvert.\nLes objectifs de cet ateliers sont:\nDéfinir les concepts d’équité, de diversité et d’inclusion\nIdentifier les avantages et les défis de l’ÉDI en contexte universitaire\nIdentifier comment être porteuse ou porteur de l’ÉDI lors de son parcours universitaire\nSe sensibiliser à la communication interculturelle (compétence professionnelle de demain)\nL’atelier est développé par Agathe Riallan, Coordinatrice facultaire de l’Équité, de la Diversité et de l’Inclusion (ÉDI) de la Faculté des Sciences à Université de Sherbrooke, en collaboration avec Marie-José Naud, Conseillère en équité, diversité et inclusion et coordonnatrice au Centre d’études nordiques (CEN).\n\n\n\n\n\n\n",
    "preview": {},
    "last_modified": "2021-04-30T19:26:35-04:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-01-22-introduction-to-edi-concepts-in-a-scientific-context/",
    "title": "Introduction to EDI concepts in a scientific context",
    "description": "A short introduction to EDI concepts in a scientific context.",
    "author": [
      {
        "name": "Marie-José Naud",
        "url": {}
      },
      {
        "name": "Agathe Riallan",
        "url": {}
      }
    ],
    "date": "2021-01-22",
    "categories": [
      "Career",
      "EN"
    ],
    "contents": "\nIn 2021, the BIOS2 trining program will be holding a series of training and reflection activities on equity, diversity and inclusion issues. The goal is to develop an EDI action plan for the program in order to consolidate a more inclusive, respectful and open environment.\nThe objectives of this workshop are:\nDefine the concepts of equity, diversity and inclusion\nIdentify the benefits and challenges of EDI in the university context\nRecongnize how to become an EDI bearer during one’s university career\nRaise awareness of intercultural communication (professional competence of tomorrow)\nThe workshop is developed by Agathe Riallan, Faculty Coordinator for Equity, Diversity and Inclusion (EDI) at the Faculty of Science, Université de Sherbrooke, in collaboration with Marie-José Naud, Equity, Diversity and Inclusion Advisor and Coordinator at the Centre d’études nordiques (CEN).\n\n\n\n\n\n\n",
    "preview": {},
    "last_modified": "2021-04-30T17:46:05-04:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-01-12-4-day-training-in-spatial-statistics-with-philippe-marchand/",
    "title": "4-Day Training in Spatial Statistics with Philippe Marchand",
    "description": "Training session about statistical analysis of spatial data in ecology, hosted by Philippe Marchand (UQAT). | \nSession de formation sur l’analyse statistique des données spatiales en écologie, animée par Pr. Philippe Marchand (UQAT).",
    "author": [
      {
        "name": "Philippe Marchand",
        "url": {}
      }
    ],
    "date": "2021-01-12",
    "categories": [
      "FR",
      "EN"
    ],
    "contents": "\n\n\nTexte en français à la suite.\nSpatial statistics in ecology\nBIOS² hosted an online training session about statistical analysis of spatial data in ecology, led by Pr. Philippe Marchand (UQAT). This 12-hour training was conducted in 4 sessions: January 12, 14, 19 & 21 (2021) from 1:00 to 4:00 pm EST.\nThe content included three types of spatial statistical analyses and their applications to ecology: (1) point pattern analysis to study the distribution of individuals or events in space; (2) geostatistical models to represent the spatial correlation of variables sampled at geolocated points; and (3) areal data models, which apply to measurements taken on areas in space and model spatial relationships as networks of neighbouring regions.\nThe training also included practical exercises using the R statistical programming environment.\nPhilippe Marchand is a professor in ecology and biostatistics at Institut de recherche sur les forêts, Université du Québec en Abitibi-Témiscamingue (UQAT) and BIOS² academic member. His research focuses on modeling processes that influence the spatial distribution of populations, including: seed dispersal and seedling establishment, animal movement, and the spread of forest diseases.\nIf you wish to consult the lesson materials and follow the exercises at your own pace, you can access them through this link. Basic knowledge of linear regression models and experience fitting them in R is recommended. Original repository can be found here.\nStatistiques spatiales en écologie\nBIOS² a organisé une session de formation en ligne sur l’analyse statistique des données spatiales en écologie, animée par le Pr. Philippe Marchand (UQAT). Cette formation de 12 heures s’est déroulée en 4 sessions : 12, 14, 19 & 21 janvier (2021) de 13h00 à 16h00 HNE.\nLe contenu comprenait trois types d’analyses statistiques spatiales et leurs applications en écologie : (1) l’analyse des patrons de points qui permet d’étudier la distribution d’individus ou d’événements dans l’espace; (2) les modèles géostatistiques qui représentent la corrélation spatiale de variables échantillonnées à des points géoréférencés; et (3) les modèles de données aréales, qui s’appliquent aux mesures prises sur des régions de l’espace et qui représentent les liens spatiaux par le biais de réseaux de voisinage.\nLa formation comprenait également des exercices pratiques utilisant l’environnement de programmation statistique R.\nPhilippe Marchand est professeur d’écologie et de biostatistique à l’Institut de recherche sur les forêts, Université du Québec en Abitibi-Témiscamingue (UQAT) et membre académique de BIOS². Ses travaux de recherche portent sur la modélisation de processus qui influencent la distribution spatiale des populations, incluant: la dispersion des graines et l’établissement des semis, le mouvement des animaux, et la propagation des épidémies forestières.\nSi vous souhaitez consulter le matériel pédagogique et suivre les exercices à votre propre rythme, vous pouvez y accéder par ce lien. Une connaissance de base des modèles de régression linéaire et une expérience de l’ajustement de ces modèles dans R sont recommandées. Le repositoire original se trouve ici.\n\n\n\n",
    "preview": "https://bios2.usherbrooke.ca/wp-content/uploads/2020/12/bernard-hermant-XyzPOIMqWfc-unsplash-2-1-768x512.jpg",
    "last_modified": "2021-04-30T15:21:54-04:00",
    "input_file": {}
  },
  {
    "path": "posts/2020-12-08-making-websites-with-hugo-part-2/",
    "title": "Making websites with HUGO, Part 2",
    "description": "This workshop provides a general introduction to HUGO, a popular open source framework for building websites without requiring a knowledge of HTML/CSS or web programming.",
    "author": [
      {
        "name": "Dominique Gravel",
        "url": {}
      },
      {
        "name": "Guillaume Larocque",
        "url": {}
      }
    ],
    "date": "2020-12-08",
    "categories": [
      "Technical",
      "EN"
    ],
    "contents": "\n\nContents\nUsing a theme\nExercise 1\n\nCustomizing a theme\nBasics of HTML\nA divider, used to organize content into blocks\nA span, used to organize content or text into sections with different styles. Usually on the same line.\nA paragraph\nHeadings at different levels\nAn image\nA link\n\nLink between HTML and CSS\nIn html\nIn CSS\n\nBasics of CSS\nExercise 2\n\nPartials\nExercise 3\n\nNow a bit of GO lang to make the featured species different.\nExercise 4\n\niFrames\nExercise 5\n\n\nUsing a theme\nIt is usually a good idea to not modify a template directly, but to have the template and the site in a separate folder. The basic concept when doing this is that the config.toml file of the site has to link to the proper folder of the theme.\nFor example\ntheme = \"template-site\"\nthemesDir = \"../..\"\nThis means that the template site is in a folder named template-site which is a parent folder of the site folder. Other options are possible.\nUsually, all the content should go in the site folder, not in the theme folder.\nExercise 1\nStart modifying the theme to make it look like a website for a Zoo. Choose your preferred color scheme by changing the style= parameter in the config.toml file.\nFeel free to download some images from unsplash and save them in the static/img folder. You can then use these images in the carrousel, as “testimonial” photos or as background images for some of the sections. You can add or remove sections from the home page by editing the config.toml file and changing the enable= parameter in the params. segment at the bottom.\nYou can also try to create a new blog entry by adding a new file in the content/blog folder. This file will have a .md extension and will be written in markdown format.\nCustomizing a theme\nBasics of HTML\nCore structure of an HTML page\n<!DOCTYPE html>\n<html>\n<head>\n<title>This is my great website<\/title>\n<style>\n.css_goes_here{\n\n}\n<\/style>\n<\/head>\n<body>\n<h1>Main title<\/h1>\n<div>Main content goes here<\/div>\n<\/body>\n<\/html>\nA divider, used to organize content into blocks\n<div><\/div>\nA span, used to organize content or text into sections with different styles. Usually on the same line.\n<span><\/span>\nA paragraph\n<p><\/p>\nHeadings at different levels\n<h1>Main title<\/h1>\n<h2>Second level<\/h2>\n<h3>Third level<\/h3>\nAn image\n<img src='img/image_name.jpg'>\nA link\n<a href=\"https://bios2.github.io\">Great website here!<\/a>\nLink between HTML and CSS\nIn html\nid is always unique. Class is not.\n<div id=\"this-div-only\" class=\"this-type-of-div\">\nOne great div!\n<\/div>\nIn CSS\n“#” is applied to id and “.” is applied to class. When nothing is specified, applies to tag.\n#this-div-only{\n    font-size:24px;\n}\n\n.this-type-of-div{\n    color: #bb0000;\n}\n\ndiv{\n    display:block;\n}\nBasics of CSS\nW3 Schools CSS reference\nProperty\nDescription\nExample\nwidth, height\nwidth of item\n200px, 200pt, 100%, 100vw/vh\nmin-width, min-height\nminimum size of item\n200px, 200pt, 100%, 100vw\ncolor\nfont color\n#aa0000, red or rgb(255,0,0)\nbackground-color\ncolor of background\n#aa0000, red or rgb(255,0,0)\nborder-color\ncolor of border\n#aa0000, red or rgb(255,0,0)\nborder\nsize, type and color of border\n1px solid black\nmargin\nmargin around item (top right bottom left)\n1px, or 1px 2px 2px 1px\npadding\npadding within item, inside div for example\n10px\nfont-family\nname of font\nVerdana, Arial\nfont-size\nsize of text\n14px, 2em\ndisplay\nshould item be on the same line, or in a separate block?\ninline, block, inline-block, flex, …\nExercise 2\nCreate a file named custom.css under template-site/my-site/static/css/.\nRight-click on elements on the web page that you want to modify, then click on Inspect element and try to find CSS properties that you could modify to improve the look of the page. Then, choosing the proper class, add entries in the custom.css file that start with a dot (.) followed by the proper class names.\n.this-class {\n    font-size:28px;\n}\nPartials\nPartials are snippets of HTML code that could be reused on different places on the website. For example, you will see that the layouts/index.html file in the template-site folder lists all the partials that create the home page.\nAn important point to remember is that Hugo will look for files first in the site’s folders, and if it doesn’t find the files there, it will look for them in the theme’s folder. So site folder layouts and CSS take priority over the theme folder.\nExercise 3\nCreate a new folder template-site/my-site/layouts. In this folder, create a new file named index.html and copy the content of the template-site/layouts/index.html file into it. Remove the testimonials section from the newly created file.\nCreate a new folder template-site/my-site/layouts/partials. In this folder, create a new file named featured-species.html put the following content into it, replacing the information with the species you selected.\n<div class=\"featured-species\">\n<img src=\"img/species/frog.jpg\" class=\"species-image\" alt=\"\" >\n<div class=\"species-description\">\n<h3>Red-Eyed Tree Frog<\/h3>\n<p>This frog can be found in the tropical rain forests of Costa Rica.<\/p>\n<\/div>\n<\/div>\nThen, add this section to the index.html file created above.\n{{ partial \"featured_species.html\" . }}\nYou will probably need to restart the Hugo server to see the changes appear on the site.\nNow, you need to edit the CSS! In your custom.css file, add the following lines.\n\n.featured-species{\n    height:300px;\n    background-color: #1d1f20;\n    color:white;\n}\n\n.species-image{\n    height:300px;\n    float:left;\n}\n\n.featured-species h3{\n    color:white;\n    font-size:1.5em;\n}\n\n.species-description{\n    float:left;\n    padding:20px;\n    font-size:2em;\n}\nModify this as you see fit!\nNow a bit of GO lang to make the featured species different.\nIntroduction to Hugo templating\nExercise 4\nReplace your partial featured-species.html content with this one\n{{ range .Site.Data.species }}\n    {{ if eq (.enable) true }}\n            <div class=\"featured-species\">\n            <img src=\"img/species/{{ .image }}\" class=\"species-image\" alt=\"\" >\n            <div class=\"species-description\">\n            <h3>{{ .name }}<\/h3>\n            <p> {{ .description }}<\/p>\n            <\/div>\n            <\/div>\n    {{end}}\n{{end}}\nNow, create a new folder /template-site/my-site/data/species.\nIn this folder, create new file named frog.yaml with the following content.\nenable: true\nname: \"Red-eyed tree frog\"\ndescription: \"This frog can be found in the forests of Costa Rica\"\nimage: \"frog.jpg\"\nFind other species photos and add them to the img folder. Then you can add new .yaml files in the data/species folder for each species.\niFrames\nAn iFrame is a HTML tag that essentially allows you to embed another web page inside of your site.\nExercise 5\nFind a Youtube video and click on the share option below the video. Find the Embed option and copy the code that starts with <iframe> to a new partial that will be shown on a new page. Surround the iframe with a div tag with class=\"video\". For example:\n<div class=\"video\">\n<iframe \nwidth=\"560\" \nheight=\"315\" \nsrc=\"https://www.youtube.com/embed/42GAn4v5MgE\" \nframeborder=\"0\" \nallow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" \nallowfullscreen>\n<\/iframe>\n<\/div>\nEdit the custom.css file and add this section\n.video{\n    width:100%;\n    background-color:black;\n    text-align:center;\n}\n\n\n\n",
    "preview": "posts/2020-12-08-making-websites-with-hugo-part-2/thumb.png",
    "last_modified": "2021-04-29T16:16:42-04:00",
    "input_file": {},
    "preview_width": 3887,
    "preview_height": 1018
  },
  {
    "path": "posts/2020-12-07-making-websites-with-hugo-part-1/",
    "title": "Making websites with HUGO, Part 1",
    "description": "This workshop provides a general introduction to HUGO, a popular open source framework for building websites without requiring a knowledge of HTML/CSS or web programming.",
    "author": [
      {
        "name": "Dominique Gravel",
        "url": {}
      },
      {
        "name": "Guillaume Larocque",
        "url": {}
      }
    ],
    "date": "2020-12-07",
    "categories": [
      "Technical",
      "EN"
    ],
    "contents": "\n\nContents\nWhy this training workshop ?\nMake sure Hugo is installed and check version\nBe Timothée Poisot for fun\nExercise : Edit the toml file to include your own information.\n\nBuild the static html files\nBuild for local development\nBuild for publishing your website\n\nEdit content\nExercise : take 15 minutes to remove Tim’s material and replace it by the three chapters of your thesis.\n\nHosting the website on a server\nGitHub User or Organization Pages\nStep-by-step Instructions\nPut it Into a Script\n\n\nPush source and build repos.\n\nWhy this training workshop ?\nI am only 10 hours of a crash course in web development ahead of you. As part of a major research project on setting a biodiversity observation network, I had to develop a prototype of a portal for the project, for biodiversity information and bunch of dashboards on biodiversity trends. Never made a website before. I know how to code in a few langages, and I know that I hate playing with boxes, menus, importing images manually, and most of all, dealing with a crash of the system and having to redo the whole thing because I made a mistake somewhere. Not that a bug when I try to compile is better, but at least it is more tractable.\nHugo made it very easily because of its fundamental feature (which is the same reason I edit papers with LaTeX): the distinction between the view and the content. Once you have set up the rules defining the visual aspects of the pages, then you can focus on the content and let the software automatically constructing the html code for you. It’s fast, accessible, scriptable and could be version-controlled. All qualities for an open and reproducible science.\nTook me a few hours to learn the basics (much harder to get the higher level skills, especially to write your own Go scripts), I took some tricks here and there in different templates and at looking what others do, and that was it I had my website. Realized that it could be a good entry level course to BIOS2 fellows and decided to turn that experience into a training workshop.\nYou will find below basic instructions to install and run a template. The following is not a full tutorial, for that I recommend simply to take time looking at the documentation provided on the Hugo page (https://gohugo.io/). I also consulted the online book Hugo in action (https://www.manning.com/books/hugo-in-action). There are many other references, all of them with goods and bads. But it’s nice to have multiple ones because sometimes the description of a concept may be obscure in one reference but better in the other and it’s by comparing and switching between them that you can make progress.\nMake sure Hugo is installed and check version\nFirst step, you have to make sure that it is properly installed on you computer. Type the following command in terminal to make sure :\nhugo version\nYou can access to the help menu with the simple command :\nhugo help\nBe Timothée Poisot for fun\nWe will use Tim’s website, which is a simple but efficient example of what we could achieve with Hugo. The strenght of the website is that it automatically updates with the addition of new content, such as publications, lab members and projects. The only thing you have to do, once the template is properly set up, is to update the content. That way, yo can focus on the material you want to put on, without struggling on how to place the boxes, format the police and all of the complicate stuff that comes with html and css. The content, written in markdown, is human readable and therefore could be easily edited by lab members. Further, since it’s all scripted, it’s easy to maintain and control versions.\nTake few minutes to look at the final webpage at https://poisotlab.io/\nNow you will clone the repository on your own computer so that you could start playing with the content, edit the files, modify list of papers and so on.\nYou can either use the clone button on the top of the page or the following command :\ngit clone https://github.com/bios2/Hugo-training-workshop.git\nWe will take a few minutes to look at the content of the different folders. This structure is common to most of the Hugo templates. You will find multiple folders, it’s useful to understand what’s located where because the compiler expects this structure when it looks for specific information.\narchetypes (not in here, but usually in most templates). These are basic instructions to generate new content with the hugo new command. We won’t use this feature today, but information about this feature is easy to find.\nassets contains the css files where the controls for visual aspect of the pages are specified. That’s where you’ll search for the different items and how to specify things such as box sizes, font colors and dimensions etc…. Note: assets directory is not created by default.\ncontent holds all of the .md files where the main content of the pages is provided. It’s divided in several subfolders, corresponding to the different pages from the menu. Each top-level folder in Hugo is considered a content section (which is described usually in the config file). For instance, you have one folder called Research where the projects are described. You’ll find one .md file per projec tin this folder. Note also that the folders contain systematically a _index.md file where the metadata and the top level information of the page are specified. We’ll come back to that later.\ndata stores specific information that will be consulted by the parser during compilation (configurationfiles). There are also data templates, and at the moment, there is one json file where the papers are listed and two toml files with a list of the students, past and present. json files could be edited with a text editor (not so fun), but there are some tools to do it efficiently.\nlayouts contains the core files to compile the website. You will find in them instructions, in a strange blend of html and Go langages. No so easy and pleasant to play with, but looking at them tells you a bit about what the compiler does (a good example is for people). list.html for instance contains a loop that goes through the toml files in order to create the icons, the text and the link to the full markdown page where you have description for each student. You will find layouts for the main pages, as well as for partials (like the header menu).\nresources also contains css instructions for the template. We won’t work with this one.\nstatic contains bunch of little things that are called during compilation. You’ll find the logo for the lab, the pictures for students, pdf files for applications, images for each research project …\nThere is also one very important file in the main folder the config.toml file. Inside, you will find a lot of the metadata that will control the structure of the main page. This find can be very simple for some templates, much more complicated for other ones. Note that for some templates, the config file may be in a distinct folder. Not all templates have exactly the same folder structure.\ntoml is a file format for configuration files, it contains key parameters for the webpage. It consists of key = “value” pairs, [section names], and # comments. Let’s open this one to have a closer look.\nExercise : Edit the toml file to include your own information.\nYou may want to change the section People to Collaborators and also provide a proper reference to your on github page. You can also add or remove sections, this will affect the menu at the top of the page. For instance, you can add a blog section.\nBuild the static html files\nBuild for local development\nHugo will use all of the material to generate static html files that will be displayed on your browser. The command is really easy to use to run it on your own computer, you simply have to type the following in the main folder :\nhugo server\nAnd that’s it, it compiles and you can simply open it in your browser by clicking on the adress indicated in the terminal. Congratulations for your first Hugo webste !\nThere are useful information in the terminal about the building process.\nBuild for publishing your website\nThe command hugo server is very fast and useful to test your website while you develop it. But once you’ll be ready to distribute it, you’ll need all of the html files and related material to distribute the website. This is easily done with the even simpler command\nhugo\nYou will find in the directory that a new folder named public appeared, with all of the material needed to deploy the website. If you click on the index.html file, you’ll get to the home page of the website. It is interesting to open this file in your text editor, you’ll get a sense of the html code that hugo generated automatically for you. You can also take a look at other files.\nEdit content\nEditing content is the easier thing to do. First thing to do, is to modify the content of the introduction paragraph on the main page. You’ll find it in the *_index.md* file in the content folder. Open it and modify the text. You can after build the main page again to see the update.\nYou can also add material, with new md files. We will do so with a new research project (note the following could be done manually):\nhugo new research/chapter1.md\nThis will generate a new markdown file, in which you can start adding material. But those files do have a particular structure, so before editing it, we’ll take a quick look at another one, datascience.md.\nThe header section is typical of a markdown file with metadata (in toml or yaml format). You have to specify information to the parser about the title, the image and associated papers. Note that it will work if some of these (e.g. papers) are missing. You can modify the image as well.\nThe file here also a particular structure, with the  marker between two paragraphs. This command indicates that only the first paragraph is displayed on the main page of the Research tab, and the full content follows if you click to know more about the project.\nNote that here you can use the basic features of markdown, with headers, bold, italics and so on. You can also include html code directly into the markdown and it should work. That said, it may conflict with higher level instructions in the layout or in the theme and may cause difficulties at building. While it is feasible to add such command, it is not recommended to do so. People rather suggest to use shortcodes (Tomorrow) or to modify the layout of the website.\nExercise : take 15 minutes to remove Tim’s material and replace it by the three chapters of your thesis.\nHosting the website on a server\nThere are many options to host your new website on a server. An easy one, free, and that could be coupled with version control is to run it on github. Full instructions are available here :\nhttps://gohugo.io/hosting-and-deployment/hosting-on-github/\nWe will simply follow the instructions copied here for hosting a personal page. Note that you can also develop a page for a project.\nGitHub User or Organization Pages\nStep-by-step Instructions\nCreate a  (e.g. blog) repository on GitHub. This repository will contain Hugo’s content and other source files.\nCreate a .github.io GitHub repository. This is the repository that will contain the fully rendered version of your Hugo website.\ngit clone  && cd \nPaste your existing Hugo project into the new local  repository. Make sure your website works locally (hugo server or hugo server -t ) and open your browser to http://localhost:1313.\nOnce you are happy with the results: Press Ctrl+C to kill the server Before proceeding run rm -rf public to completely remove the public directory\ngit submodule add -b main https://github.com//.github.io.git public. This creates a git submodule. Now when you run the hugo command to build your site to public, the created public directory will have a different remote origin (i.e. hosted GitHub repository).\nMake sure the baseURL in your config file is updated with: .github.io\nPut it Into a Script\nYou’re almost done. In order to automate next steps create a deploy.sh script. You can also make it executable with chmod +x deploy.sh.\nThe following are the contents of the deploy.sh script:\n    #!/bin/sh\n\n    # If a command fails then the deploy stops\n    set -e\n\n    printf \"\\033[0;32mDeploying updates to GitHub...\\033[0m\\n\"\n\n    # Build the project.\n    hugo # if using a theme, replace with `hugo -t <YOURTHEME>`\n\n    # Go To Public folder\n    cd public\n\n    # Add changes to git.\n    git add .\n\n    # Commit changes.\n    msg=\"rebuilding site $(date)\"\n    if [ -n \"$*\" ]; then\n        msg=\"$*\"\n    fi\n    git commit -m \"$msg\"\nPush source and build repos.\ngit push origin main\nYou can then run ./deploy.sh \"Your optional commit message\" to send changes to .github.io. Note that you likely will want to commit changes to your  repository as well.\nThat’s it! Your personal page should be up and running at https://.github.io within a couple minutes.\n\n\n\n",
    "preview": "posts/2020-12-07-making-websites-with-hugo-part-1/thumb.png",
    "last_modified": "2021-04-29T16:17:22-04:00",
    "input_file": {},
    "preview_width": 3887,
    "preview_height": 1018
  },
  {
    "path": "posts/2020-06-15-science-communication/",
    "title": "Science Communication",
    "description": "Recordings, content and handouts from a 6-hour Science Communication workshop held over two days on 15 and 16 June 2020.",
    "author": [
      {
        "name": "Gracielle Higino",
        "url": {}
      },
      {
        "name": "Katherine Hébert",
        "url": {}
      }
    ],
    "date": "2020-06-15",
    "categories": [
      "Career",
      "Fellow contributed",
      "EN"
    ],
    "contents": "\n\nContents\nDay 1\nDay 2\nSession 1: The basics of science communication\nSession 2: Social media as a science communication tool\n\nThe objective of this training is to share and discuss the concepts and tools that contribute to effective science communication. The training is split into two sessions, which cover the basic concepts of effective science communication and how social media tools can be used to boost the signal of your research and extend your research network. Each training takes the form of a presentation interspersed with several short activity modules, where participants are invited to use the tools we will be discussing to kickstart their own science communication.\nThis training was given on June 1 and 2, 2020. You can view recordings of each session here:\nDay 1\n\n\nDay 2\n\n\nSession 1: The basics of science communication\nObjectives:\nDiscuss what science communication (or SciComm) can be, and its potential role in boosting the signal of your research\nMake an overview of basic concepts and tools that you can use in any medium (blog posts, presentations, conversations, twitter, etc.) to do effective science communication\nDuring this session, we:\nDiscuss the potential pitfalls of science communication (notably, diversity and inclusivity problems).\nCover the basic concepts of science communication, including the Golden Circle method, the creation of personas, and storytelling techniques.\nHave short activities where participants can try to use some of the techniques we will be covering, such as filling in their own Golden Circle and explaining a blog post as a storyboard.\n\n\n\nSession 2: Social media as a science communication tool\nObjectives:\nRethink the way we write about science by exploring the world of blog posts\nClarify the mechanics of Twitter and how it can be used effectively for science communication\nDuring this session, we:\nDiscuss how to create a story structure using titles and the flow of ideas in blog posts, especially when we are used to writing scientific articles\nCover the basics of how Twitter works (retweets, threads, replies, hashtags, photo captions, etc.) and how to find helpful connections\nHave short activities where participants will be invited to write their own Twitter biographies and to create a Twitter thread explaining a project of their choice.\n\n\n\n\n\n\n",
    "preview": "posts/2020-06-15-science-communication/scicomm_training.png",
    "last_modified": "2021-04-28T11:53:48-04:00",
    "input_file": {},
    "preview_width": 1548,
    "preview_height": 800
  },
  {
    "path": "posts/2020-04-30-sensibilisation-aux-ralits-autochtones-et-recherche-collaborative-partie-2/",
    "title": "Sensibilisation aux réalités autochtones et recherche collaborative, partie 2",
    "description": "Série de deux webinaires sur la sensibilisation aux réalités autochtones et la recherche en collaboration avec les Autochtones, offert du 28 au 30 avril 2020 par Catherine-Alexandra Gagnon, PhD.",
    "author": [
      {
        "name": "Dr Catherine-Alexandra Gagnon",
        "url": {}
      }
    ],
    "date": "2020-04-30",
    "categories": [
      "Career",
      "FR"
    ],
    "contents": "\n\nContents\nPartie 2 - Recherche en collaboration avec les communautés autochtones\nObjectifs de la formation :\nDurant ce webminaire, nous allons: \nRessources\nBalados\nLectures, sites internet\nFilmographie\nRéférences\n\nFormatrice :\n\n\nPartie 2 - Recherche en collaboration avec les communautés autochtones\nObjectifs de la formation :\nEntamer une réflexion collective envers nos pratiques de recherche et comment s’engager de manière significative avec les communautés autochtones.\nDévelopper une meilleure compréhension des perceptions et attentes des communautés envers la recherche et les chercheurs.\nDurant ce webminaire, nous allons: \nMieux comprendre la nécessité de prendre en compte les connaissances autochtones dans divers aspects de la gestion environnementale au Canada; \nDiscuter du désir des communauté d’avoir une présence accrue dans le milieu de la recherche : comment faire?\nAborder et débattre des différentes approches méthodologiques pour établir des ponts en les connaissances autochtones et scientifiques.\nRessources\nBalados\n\nLectures, sites internet\nTruth and Reconciliation Commission Reports\nFinal Report: National Inquiry into Missing and Murdered Indigenous Women and Girls\nReport of the Royal Commission on Aboriginal Peoples\nMythes et réalités sur les peuples autochtones\nWhere are the children? Healing the legacy of the residential schools\nIndigenous Canada (Coursera)\n“Indigenous Writes,” by Chelsea Vowel\n“21 things you might not know about the Indian Act: Helping Canadians make reconciliation with Indigenous Peoples a reality.”\nNorthern Quebec: Issues, Spaces and Cultures (MOOC Université Laval)\nFilmographie\nNational Film Board of Canada\nPeuples autochtones au Canada (Premières Nations et Métis)\nIndigenous Peoples in Canada (Inuit)\nWapikoni\nRéférences\n(Armitage et al. 2011): Co-managements and the co-production of knowledge: learning to adapt in Canada’s Arctic.\n(Berkes 1999): Sacred ecology: traditional ecological knowledge and resource management.1\n(Berkes 2009): Evolution of co-management: role of knowledge generation, bridging organizations and social learning.\n(Berkes, Colding, and Folke 2000): Rediscovery of traditional ecological knowledge as adaptive management.\n(Gagnon et al. 2020): Merging indigenous and scientific knowledge links climate with the growth of a large migratory caribou population.\n(Gagnon and Berteaux 2009): Integrating traditional ecological knowledge and ecological science: a question of scale.\n(Gearheard and Shirley 2009): Challenges in community-research relationships: learning from natural science in Nunavut.\n(Nickels, Shirley, and Laidler 2006): Negotiating research relationships with Inuit communities: a guide for researchers.\n(Kendrick, Lyver, and K’é Dene First Nation 2005): Denésqliné (Chipewyan) knowledge of barren-ground caribou (Rangifer tarandus groenlandicus) movements.\n(Kofinas et al. 2003): Towards a protocol for community monitoring of caribou body condition.\n(Kofinas G. 2002): Community contributions to ecological monitoring: knowledge co-production in the U.S.-Canada Arctic Borderlands.\n(Kofinas et al. 2000): Research planning in the face of change: the human role in reindeer/caribou systems.\n(Lyver and Dene First Nation 2010): Monitoring barren-ground caribou body condition with Denésôåiné traditional knowledge.\n(M. Mallory, Akearok, and Gilchrist 2006): Local ecological knowledge of the Sleeper and Split Islands.\n(M. L. Mallory et al. 2003): Local Ecological Knowledge of Ivory Gull Declines in Arctic Canada.\n(Ostrom and Ahn 2001): A social science perspective on social capital: social capital and collective action.\n(Plummer and FitzGibbon 2006): People matter: the importance of social capital in the co-management of natural resources.\n(Plummer and FitzGibbon 2007): Connecting adaptive co-management, social learning, and social capital through theory and practice.\n(Reid and Millennium Ecosystem Assessment (Program) 2006): Bridging scales and knowledge systems: concepts and applications in ecosystem assessment.\nFormatrice :\nCatherine-Alexandra Gagnon possède une expertise dans le travail collaboratif en milieux autochtones. Elle s’intéresse particulièrement à la mise en commun des savoirs locaux, autochtones et scientifiques. Elle détient un doctorat en Sciences de l’environnement et une maîtrise en Gestion de la faune de l’Université du Québec à Rimouski, un baccalauréat en biologie faunique de l’université McGill ainsi qu’un certificat en Études autochtones de l’université de Montréal. Durant ses études, elle a travaillé sur les connaissances locales et ancestrales des Aîné(e)s et chasseurs Inuit, Inuvialuit et Gwich’in du Nunavut, des Territoires du Nord-Ouest et du Yukon.\n\n\n\nArmitage, Derek, Fikret Berkes, Aaron Dale, Erik Kocho-Schellenberg, and Eva Patton. 2011. “Co-Management and the Co-Production of Knowledge: Learning to Adapt in Canada’s Arctic.” Global Environmental Change 21 (3): 995–1004. https://doi.org/10.1016/j.gloenvcha.2011.04.006.\n\n\nBerkes, Fikret. 1999. Sacred Ecology: Traditional Ecological Knowledge and Resource Management. Philadelphia, PA: Taylor & Francis.\n\n\n———. 2009. “Evolution of Co-Management: Role of Knowledge Generation, Bridging Organizations and Social Learning.” Journal of Environmental Management 90 (5): 1692–702. https://doi.org/10.1016/j.jenvman.2008.12.001.\n\n\nBerkes, Fikret, Johan Colding, and Carl Folke. 2000. “REDISCOVERY OF TRADITIONAL ECOLOGICAL KNOWLEDGE AS ADAPTIVE MANAGEMENT.” Ecological Applications 10 (5): 1251–62. https://doi.org/10.1890/1051-0761(2000)010[1251:ROTEKA]2.0.CO;2.\n\n\nGagnon, Catherine A., and Dominique Berteaux. 2009. “Integrating Traditional Ecological Knowledge and Ecological Science: A Question of Scale.” Ecology and Society 14 (2): art19. https://doi.org/10.5751/ES-02923-140219.\n\n\nGagnon, Catherine A., Sandra Hamel, Don E. Russell, Todd Powell, James Andre, Michael Y. Svoboda, and Dominique Berteaux. 2020. “Merging Indigenous and Scientific Knowledge Links Climate with the Growth of a Large Migratory Caribou Population.” Edited by Meredith Root‐Bernstein. Journal of Applied Ecology 57 (9): 1644–55. https://doi.org/10.1111/1365-2664.13558.\n\n\nGearheard, Shari, and Jamal Shirley. 2009. “Challenges in Community-Research Relationships: Learning from Natural Science in Nunavut.” ARCTIC 60 (1): 62–74. https://doi.org/10.14430/arctic266.\n\n\nKendrick, A, P O’B Lyver, and Łutsël K’é Dene First Nation. 2005. “Denésqliné (chipewyan) Knowledge of Barren-Ground Caribou (rangifer Tarandus Groenlandicus) Movements.” Arctic, 175–91.\n\n\nKofinas G., Aklavik. 2002. “Community Contributions to Ecological Monitoring: Knowledge Co-Production in the U.S.-Canada Arctic Borderlands.” In The Earth Is Faster Now: Indigenous Observations of Arctic Environmental Change, 55–91. Fairbanks, USA: Arctic Research Consortium of the United States.\n\n\nKofinas, Gary, Phil Lyver, Don Russell, Robert White, Augie Nelson, and Nicholas Flanders. 2003. “Towards a Protocol for Community Monitoring of Caribou Body Condition.” Rangifer 23 (5): 43. https://doi.org/10.7557/2.23.5.1678.\n\n\nKofinas, Gary, Gail Osherenko, David Klein, and Bruce Forbes. 2000. “Research Planning in the Face of Change: The Human Role in Reindeer/Caribou Systems.” Polar Research 19 (1): 3–21. https://doi.org/10.1111/j.1751-8369.2000.tb00323.x.\n\n\nLyver, P. O.’B., and Lutsël K’é Dene First Nation. 2010. “Monitoring Barren-Ground Caribou Body Condition with Denésôåiné Traditional Knowledge.” ARCTIC 58 (1): 44–54. https://doi.org/10.14430/arctic388.\n\n\nMallory, M., J. Akearok, and G. Gilchrist. 2006. “Local Ecological Knowledge of the Sleeper and Split Islands.” In Climate Change: Integrating Traditional and Scientific Knowledge, 203–8. Winnipeg, Manitoba, Canada: Aboriginal Issues Press.\n\n\nMallory, M. L., H. Grant Gilchrist, Alain J. Fontaine, and Jason A. Akearok. 2003. “Local Ecological Knowledge of Ivory Gull Declines in Arctic Canada.” ARCTIC 56 (3): 293–98. https://doi.org/10.14430/arctic625.\n\n\nNickels, Scot, Jamal Shirley, and Gita Laidler. 2006. Negotiating Research Relationships with Inuit Communities: A Guide for Researchers. Inuit Tapiriit Kanatami Ottawa, Ont.\n\n\nOstrom, Elinor, and TK Ahn. 2001. “A SOCIAL SCIENCE PERSPECTIVE ON SOCIAL CAPITAL: SOCIAL CAPITAL AND COLLECTIVE ACTION.”\n\n\nPlummer, Ryan, and John FitzGibbon. 2006. “People Matter: The Importance of Social Capital in the Co-Management of Natural Resources.” Natural Resources Forum 30 (1): 51–62. https://doi.org/10.1111/j.1477-8947.2006.00157.x.\n\n\n———. 2007. “Connecting Adaptive Co-Management, Social Learning, and Social Capital Through Theory and Practice.” Adaptive Co-Management: Collaboration, Learning, and Multi-Level Governance. University of British Columbia Press, Vancouver, British Columbia, Canada, 38–61.\n\n\nReid, Walter V., and Millennium Ecosystem Assessment (Program), eds. 2006. Bridging Scales and Knowledge Systems: Concepts and Applications in Ecosystem Assessment. A Contribution to the Millennium Ecosystem Assessment. Washington, D.C: Island Press.\n\n\nA more recent edition exists.↩︎\n",
    "preview": "posts/2020-04-30-sensibilisation-aux-ralits-autochtones-et-recherche-collaborative-partie-2/thumb.jpg",
    "last_modified": "2021-04-29T17:07:08-04:00",
    "input_file": {}
  },
  {
    "path": "posts/2020-04-28-sensibilisation-aux-ralits-autochtones-et-recherche-collaborative-partie-1/",
    "title": "Sensibilisation aux réalités autochtones et recherche collaborative, partie 1",
    "description": "Série de deux webinaires sur la sensibilisation aux réalités autochtones et la recherche en collaboration avec les Autochtones, offert du 28 au 30 avril 2020 par Catherine-Alexandra Gagnon, PhD.",
    "author": [
      {
        "name": "Dr Catherine-Alexandra Gagnon",
        "url": {}
      }
    ],
    "date": "2020-04-28",
    "categories": [
      "Career",
      "FR"
    ],
    "contents": "\n\nContents\nPartie 1 - Sensibilisation aux réalités autochtones\nObjectifs de la formation :\nDurant ce webminaire, nous allons: \nRessources\nBalados\nLectures, sites internet\nFilmographie\nRéférences\n\nFormatrice :\n\n\nPartie 1 - Sensibilisation aux réalités autochtones\nObjectifs de la formation :\nAméliorer notre compréhension du passé et de ses impacts sur nos relations entre le avec les Peuples Autochtones.\nDévelopper des notions et compétences afin d’agir contre les préjugés et le racisme.\nDurant ce webminaire, nous allons: \nFaire un survol des événements historiques importants et de leurs impacts à ce jour (Loi sur les Indiens, politiques d’assimilation, les pensionnats, etc.). \nAcquérir des connaissances sur la terminologie autochtone.\nFaire un survol de certains procès et contextes légaux et voir comment ils affectent notre travail en territoire autochtone.\nDans une optique de réconciliation, faire une prise de conscience des préjugés persistants et discuter de stratégies pour améliorer nos relations avec les communautés.\nRessources\nBalados\n\nLectures, sites internet\nTruth and Reconciliation Commission Reports\nFinal Report: National Inquiry into Missing and Murdered Indigenous Women and Girls\nReport of the Royal Commission on Aboriginal Peoples\nMythes et réalités sur les peuples autochtones\nWhere are the children? Healing the legacy of the residential schools\nIndigenous Canada (Coursera)\n“Indigenous Writes,” by Chelsea Vowel\n“21 things you might not know about the Indian Act: Helping Canadians make reconciliation with Indigenous Peoples a reality.”\nNorthern Quebec: Issues, Spaces and Cultures (MOOC Université Laval)\nFilmographie\nNational Film Board of Canada\nPeuples autochtones au Canada (Premières Nations et Métis)\nIndigenous Peoples in Canada (Inuit)\nWapikoni\nRéférences\n(Armitage et al. 2011): Co-managements and the co-production of knowledge: learning to adapt in Canada’s Arctic.\n(Berkes 1999): Sacred ecology: traditional ecological knowledge and resource management.1\n(Berkes 2009): Evolution of co-management: role of knowledge generation, bridging organizations and social learning.\n(Berkes, Colding, and Folke 2000): Rediscovery of traditional ecological knowledge as adaptive management.\n(Gagnon et al. 2020): Merging indigenous and scientific knowledge links climate with the growth of a large migratory caribou population.\n(Gagnon and Berteaux 2009): Integrating traditional ecological knowledge and ecological science: a question of scale.\n(Gearheard and Shirley 2009): Challenges in community-research relationships: learning from natural science in Nunavut.\n(Nickels, Shirley, and Laidler 2006): Negotiating research relationships with Inuit communities: a guide for researchers.\n(Kendrick, Lyver, and K’é Dene First Nation 2005): Denésqliné (Chipewyan) knowledge of barren-ground caribou (Rangifer tarandus groenlandicus) movements.\n(Kofinas et al. 2003): Towards a protocol for community monitoring of caribou body condition.\n(Kofinas G. 2002): Community contributions to ecological monitoring: knowledge co-production in the U.S.-Canada Arctic Borderlands.\n(Kofinas et al. 2000): Research planning in the face of change: the human role in reindeer/caribou systems.\n(Lyver and Dene First Nation 2010): Monitoring barren-ground caribou body condition with Denésôåiné traditional knowledge.\n(M. Mallory, Akearok, and Gilchrist 2006): Local ecological knowledge of the Sleeper and Split Islands.\n(M. L. Mallory et al. 2003): Local Ecological Knowledge of Ivory Gull Declines in Arctic Canada.\n(Ostrom and Ahn 2001): A social science perspective on social capital: social capital and collective action.\n(Plummer and FitzGibbon 2006): People matter: the importance of social capital in the co-management of natural resources.\n(Plummer and FitzGibbon 2007): Connecting adaptive co-management, social learning, and social capital through theory and practice.\n(Reid and Millennium Ecosystem Assessment (Program) 2006): Bridging scales and knowledge systems: concepts and applications in ecosystem assessment.\nFormatrice :\nCatherine-Alexandra Gagnon possède une expertise dans le travail collaboratif en milieux autochtones. Elle s’intéresse particulièrement à la mise en commun des savoirs locaux, autochtones et scientifiques. Elle détient un doctorat en Sciences de l’environnement et une maîtrise en Gestion de la faune de l’Université du Québec à Rimouski, un baccalauréat en biologie faunique de l’université McGill ainsi qu’un certificat en Études autochtones de l’université de Montréal. Durant ses études, elle a travaillé sur les connaissances locales et ancestrales des Aîné(e)s et chasseurs Inuit, Inuvialuit et Gwich’in du Nunavut, des Territoires du Nord-Ouest et du Yukon.\n\n\n\nArmitage, Derek, Fikret Berkes, Aaron Dale, Erik Kocho-Schellenberg, and Eva Patton. 2011. “Co-Management and the Co-Production of Knowledge: Learning to Adapt in Canada’s Arctic.” Global Environmental Change 21 (3): 995–1004. https://doi.org/10.1016/j.gloenvcha.2011.04.006.\n\n\nBerkes, Fikret. 1999. Sacred Ecology: Traditional Ecological Knowledge and Resource Management. Philadelphia, PA: Taylor & Francis.\n\n\n———. 2009. “Evolution of Co-Management: Role of Knowledge Generation, Bridging Organizations and Social Learning.” Journal of Environmental Management 90 (5): 1692–702. https://doi.org/10.1016/j.jenvman.2008.12.001.\n\n\nBerkes, Fikret, Johan Colding, and Carl Folke. 2000. “REDISCOVERY OF TRADITIONAL ECOLOGICAL KNOWLEDGE AS ADAPTIVE MANAGEMENT.” Ecological Applications 10 (5): 1251–62. https://doi.org/10.1890/1051-0761(2000)010[1251:ROTEKA]2.0.CO;2.\n\n\nGagnon, Catherine A., and Dominique Berteaux. 2009. “Integrating Traditional Ecological Knowledge and Ecological Science: A Question of Scale.” Ecology and Society 14 (2): art19. https://doi.org/10.5751/ES-02923-140219.\n\n\nGagnon, Catherine A., Sandra Hamel, Don E. Russell, Todd Powell, James Andre, Michael Y. Svoboda, and Dominique Berteaux. 2020. “Merging Indigenous and Scientific Knowledge Links Climate with the Growth of a Large Migratory Caribou Population.” Edited by Meredith Root‐Bernstein. Journal of Applied Ecology 57 (9): 1644–55. https://doi.org/10.1111/1365-2664.13558.\n\n\nGearheard, Shari, and Jamal Shirley. 2009. “Challenges in Community-Research Relationships: Learning from Natural Science in Nunavut.” ARCTIC 60 (1): 62–74. https://doi.org/10.14430/arctic266.\n\n\nKendrick, A, P O’B Lyver, and Łutsël K’é Dene First Nation. 2005. “Denésqliné (chipewyan) Knowledge of Barren-Ground Caribou (rangifer Tarandus Groenlandicus) Movements.” Arctic, 175–91.\n\n\nKofinas G., Aklavik. 2002. “Community Contributions to Ecological Monitoring: Knowledge Co-Production in the U.S.-Canada Arctic Borderlands.” In The Earth Is Faster Now: Indigenous Observations of Arctic Environmental Change, 55–91. Fairbanks, USA: Arctic Research Consortium of the United States.\n\n\nKofinas, Gary, Phil Lyver, Don Russell, Robert White, Augie Nelson, and Nicholas Flanders. 2003. “Towards a Protocol for Community Monitoring of Caribou Body Condition.” Rangifer 23 (5): 43. https://doi.org/10.7557/2.23.5.1678.\n\n\nKofinas, Gary, Gail Osherenko, David Klein, and Bruce Forbes. 2000. “Research Planning in the Face of Change: The Human Role in Reindeer/Caribou Systems.” Polar Research 19 (1): 3–21. https://doi.org/10.1111/j.1751-8369.2000.tb00323.x.\n\n\nLyver, P. O.’B., and Lutsël K’é Dene First Nation. 2010. “Monitoring Barren-Ground Caribou Body Condition with Denésôåiné Traditional Knowledge.” ARCTIC 58 (1): 44–54. https://doi.org/10.14430/arctic388.\n\n\nMallory, M., J. Akearok, and G. Gilchrist. 2006. “Local Ecological Knowledge of the Sleeper and Split Islands.” In Climate Change: Integrating Traditional and Scientific Knowledge, 203–8. Winnipeg, Manitoba, Canada: Aboriginal Issues Press.\n\n\nMallory, M. L., H. Grant Gilchrist, Alain J. Fontaine, and Jason A. Akearok. 2003. “Local Ecological Knowledge of Ivory Gull Declines in Arctic Canada.” ARCTIC 56 (3): 293–98. https://doi.org/10.14430/arctic625.\n\n\nNickels, Scot, Jamal Shirley, and Gita Laidler. 2006. Negotiating Research Relationships with Inuit Communities: A Guide for Researchers. Inuit Tapiriit Kanatami Ottawa, Ont.\n\n\nOstrom, Elinor, and TK Ahn. 2001. “A SOCIAL SCIENCE PERSPECTIVE ON SOCIAL CAPITAL: SOCIAL CAPITAL AND COLLECTIVE ACTION.”\n\n\nPlummer, Ryan, and John FitzGibbon. 2006. “People Matter: The Importance of Social Capital in the Co-Management of Natural Resources.” Natural Resources Forum 30 (1): 51–62. https://doi.org/10.1111/j.1477-8947.2006.00157.x.\n\n\n———. 2007. “Connecting Adaptive Co-Management, Social Learning, and Social Capital Through Theory and Practice.” Adaptive Co-Management: Collaboration, Learning, and Multi-Level Governance. University of British Columbia Press, Vancouver, British Columbia, Canada, 38–61.\n\n\nReid, Walter V., and Millennium Ecosystem Assessment (Program), eds. 2006. Bridging Scales and Knowledge Systems: Concepts and Applications in Ecosystem Assessment. A Contribution to the Millennium Ecosystem Assessment. Washington, D.C: Island Press.\n\n\nA more recent edition exists.↩︎\n",
    "preview": "posts/2020-04-28-sensibilisation-aux-ralits-autochtones-et-recherche-collaborative-partie-1/thumb.jpg",
    "last_modified": "2021-04-29T17:16:16-04:00",
    "input_file": {}
  },
  {
    "path": "posts/2020-01-14-mathematical-modeling-in-ecology-and-evolution/",
    "title": "Mathematical Modeling in Ecology and Evolution",
    "description": "This workshop will introduce participants to the logic behind modeling in biology, focusing on developing equations, finding equilibria, analyzing stability, and running simulations.Techniques will be illustrated with the software tools, Mathematica and Maxima. This workshop was held in two parts: January 14 and January 16, 2020.",
    "author": [
      {
        "name": "Dr Sarah P. Otto",
        "url": {}
      }
    ],
    "date": "2020-01-14",
    "categories": [
      "Technical",
      "EN"
    ],
    "contents": "\n\nContents\nContent\nSoftware\nMaterial\nOther resources\nThanks\n\nIn this workshop, I introduce various modelling techniques, using mostly ecological and evolutionary examples, with a focus on how computer software programs can help biologists analyze such models.\nContent\nPart 1: Classic one-variable models in ecology and evolutionPart 2: Equilibria and their stabilityPart 3: Beyond equilibriaPart 4: Example of building a model from scratchPart 5: Extending to models with more than one variablePart 6: Another example of building a model from scratch\nSoftware\nIn my research, I primarily use Mathematica, which is a powerful software package to organize and conduct analytical modelling, but it is not free (at UBC, we have some licenses available). I will also show some example code and provide translation of most of what I present in a free software package called Maxima.\nMathematica installation\nThere is a free trial version that you can use for 15 days, if you don’t have a copy (click here to access), or you can buy a student version online. If you want to make sure that all is working, copy the code below, put your cursor over each of the following lines and press enter (on some computers, “enter” is a separate button, on others, press “shift” and “return” at the same time):\nD[x^3,x]\nListPlot[Table[x, {x,1,10}],Joined->True]\nRSolve[{x[t+1]\\[Equal]A x[t],x[0]\\[Equal]x0},x[t],t]\nPDF[NormalDistribution[0,1],x]\nYou should see (a) \\(3x^2\\), (b) a plot of a line, (c) \\({{x[t]->A^t x0}}\\), and (d) \\(\\frac{e^\\frac{-x^2}{2}}{\\sqrt{2\\pi }}\\).\nMaxima installation:\nOn a Mac, install using the instructions here. For other file systems, download here.\nMaxima testing\nWhen you first open Maxima, it will give you a choice of GUIs, chose wxMaxima. Once wxMaxima is launched type this command and hit return to see if it answers 4:\n2+2;\nIf it doesn’t, then scan the installation document for the error that you run into.\nIf it does return 4, then type in and enter these commands:\ndiff(x^3, x);\n\nwxplot2d (3*x, [x, 0, 2*%pi]);\n\nload(\"solve_rec\")$\nsolve_rec(x[t+1] = A*x[t], x[t], x[0]=x0);\n\nload(\"distrib\")$\npdf_normal(x,0,1);\nYou should see (a) \\(3x^2\\), (b) a plot of a line, (c) \\({{x[t]->A^t x0}}\\), and (d) \\(\\frac{e^\\frac{-x^2}{2}}{\\sqrt{2\\pi }}\\).\nMaterial\nMathematica\nMaxima\nPDF\nNotebook\nNotebook\nEmbeded below\nHints and solutions\nHints and solutions\n\n\n\nHomework\nHomework answers\n\nHomework answers\nGuide\nGuide\n\nFollow along PDF\nThis PDF was generated from the Mathematica notebook linked above. It doesn’t include dynamic plots, but it’s a good alternative if you want to print out or have a quick reference at hand.\n\n\n\nStability analysis of a recursion equation in a discrete-time model.Other resources\nAn Introduction to Mathematical Modeling in Ecology and Evolution (Otto and Day 2007).\nBiomathematical modeling lecture notes.\nMathematica labs UBC.\nThanks\nNiki Love and Gil Henriques did a great job of translating the code into wxMaxima, with limited help from me. Thanks, Niki and Gil!!\n\n\n\nOtto, Sarah P, and Troy Day. 2007. A Biologist’s Guide to Mathematical Modeling in Ecology and Evolution. Vol. 13. Princeton University Press.\n\n\n\n\n",
    "preview": "posts/2020-01-14-mathematical-modeling-in-ecology-and-evolution/StabilityPictures.jpg",
    "last_modified": "2021-04-29T16:12:40-04:00",
    "input_file": {}
  }
]
